## Counting and removing nan values

In [6]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [8]:
blank = np.nan
np.random.seed(25)
df = DataFrame(np.random.rand(36).reshape((6,6)))
df.loc[1:3,5] = blank
df.loc[1:4,0] = blank
df

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1       NaN  0.437611  0.556229  0.367080  0.402366       NaN
2       NaN  0.585445  0.161985  0.520719  0.326051       NaN
3       NaN  0.836375  0.481343  0.516502  0.383048       NaN
4       NaN  0.559053  0.034450  0.719930  0.421004  0.436935
5  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

#### Counting NaN values: returns the column number followed by the number of nan values contained in that column

In [10]:
df.isnull().sum()

0    4
1    0
2    0
3    0
4    0
5    3
dtype: int64

#### Removing NaN values

#### Removes the columns and rows with NaN values

In [11]:
df.dropna()

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
5  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

#### Removes only the columns with NaN values

In [12]:
df.dropna(axis=1)

          1         2         3         4
0  0.582277  0.278839  0.185911  0.411100
1  0.437611  0.556229  0.367080  0.402366
2  0.585445  0.161985  0.520719  0.326051
3  0.836375  0.481343  0.516502  0.383048
4  0.559053  0.034450  0.719930  0.421004
5  0.900274  0.669612  0.456069  0.289804